Catalogs/ГруппыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ГруппыПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ПользователиГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.РежимыРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияДополнительныхПравПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияДополнительныхПравПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПраваПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.РежимыРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Право</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПраваПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиПравДоступаПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПравДоступаПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.КатегорииДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыМеню</v8:Type>
						<v8:Type>cfg:CatalogRef.Столы</v8:Type>
						<v8:Type>cfg:CatalogRef.Меню</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидокНаценок</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтказов</v8:Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецПравДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.РежимыРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ГруппыПользователей/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура РасширенныеНастройки(Команда)
	
	// Настройка формы.
	РасширенныеНастройкиНаСервере(Истина, Истина);
	
КонецПроцедуры // РасширенныеНастройки()

&НаСервере
Процедура РасширенныеНастройкиНаСервере(Режим, Полный = Ложь)
	
	// Настройка формы.
	Если Режим Тогда
	
		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
		
		Элементы.ГруппаРасширенныеНастройкиДополнительная.ОтображатьЗаголовок = Ложь;
		Элементы.ГруппаРасширенныеНастройкиДополнительная.Отображение = ОтображениеОбычнойГруппы.Нет;
		
		Если Полный Тогда
			Элементы.ГруппаНастройкиПользователей.Видимость = Истина;
			Элементы.ГруппаДополнительныеПраваПользователей.Видимость = Истина;
			Элементы.ГруппаПраваДоступаОбъектов.Видимость = Истина;
			Элементы.ГруппаПраваДоступаПользователей.Видимость = Истина;
		КонецЕсли;
		
		Элементы.ГруппаРасширенныеНастройки.Видимость = (Не Элементы.ГруппаНастройкиПользователей.Видимость) Или
														(Не Элементы.ГруппаПраваДоступаОбъектов.Видимость) Или
														(Не Элементы.ГруппаПраваДоступаПользователей.Видимость);

	Иначе
	
		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		
		Элементы.ГруппаРасширенныеНастройкиДополнительная.ОтображатьЗаголовок = Истина;
		Элементы.ГруппаРасширенныеНастройкиДополнительная.Отображение = ОтображениеОбычнойГруппы.Линия;
		
		Элементы.ГруппаНастройкиПользователей.Видимость = Ложь;
		Элементы.ГруппаДополнительныеПраваПользователей.Видимость = Ложь;
		Элементы.ГруппаПраваДоступаОбъектов.Видимость = Ложь;
		Элементы.ГруппаПраваДоступаПользователей.Видимость = Ложь;
		
	КонецЕсли; 
	
КонецПроцедуры // РасширенныеНастройкиНаСервере()


&НаКлиенте
Процедура ДополнительныеПраваПользователейФлажокПриИзменении(Элемент)
	
	Элементы.ДополнительныеПраваПользователей.ТекущиеДанные.Значение = Элементы.ДополнительныеПраваПользователей.ТекущиеДанные.Флажок;
	Элементы.ДополнительныеПраваПользователей.ТекущиеДанные.Актуальность = Элементы.ДополнительныеПраваПользователей.ТекущиеДанные.Значение;
	
КонецПроцедуры // ДополнительныеПраваПользователейФлажокПриИзменении()

&НаКлиенте
Процедура ДополнительныеПраваПользователейЗначениеПриИзменении(Элемент)
	
	Элементы.ДополнительныеПраваПользователей.ТекущиеДанные.Актуальность = ЗначениеЗаполнено(Элементы.ДополнительныеПраваПользователей.ТекущиеДанные.Значение);
	
КонецПроцедуры // ДополнительныеПраваПользователейЗначениеПриИзменении()

&НаКлиенте
Процедура НастройкиПользователейФлажокПриИзменении(Элемент)
	
	Элементы.НастройкиПользователей.ТекущиеДанные.Значение = Элементы.НастройкиПользователей.ТекущиеДанные.Флажок;
	Элементы.НастройкиПользователей.ТекущиеДанные.Актуальность = Элементы.НастройкиПользователей.ТекущиеДанные.Значение;
	
КонецПроцедуры // НастройкиПользователейФлажокПриИзменении()

&НаКлиенте
Процедура НастройкиПользователейЗначениеПриИзменении(Элемент)
	
	Элементы.НастройкиПользователей.ТекущиеДанные.Актуальность = ЗначениеЗаполнено(Элементы.НастройкиПользователей.ТекущиеДанные.Значение);
	
КонецПроцедуры // НастройкиПользователейЗначениеПриИзменении()

&НаКлиенте
Процедура ПраваДоступаПользователейАктуальностьПриИзменении(Элемент)

	// Актуальность.
	__РаботаСДаннымиКлиентСервер.ИзменитьПравилаАктуальностиПодчиненных(Элемент, ПраваДоступаПользователей);
	
КонецПроцедуры // ПраваДоступаПользователейАктуальностьПриИзменении()

&НаКлиенте
Процедура ПраваДоступаОбъектовАктуальностьПриИзменении(Элемент)

	ПользователиКлиент.ПриИзмененииАктуальностиПраваДоступаОбъектов(Элемент, ПраваДоступаОбъектов);

КонецПроцедуры // ПраваДоступаОбъектовАктуальностьПриИзменении()

&НаКлиенте
Процедура ПраваДоступаОбъектовРазделениеПриИзменении(Элемент)

	ПользователиКлиент.ПриИзмененииРазделенияПраваДоступаОбъектов(Элемент, ПраваДоступаОбъектов);
	
КонецПроцедуры // ПраваДоступаОбъектовАктуальностьПриИзменении()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Параметры.
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииНаСервере(Объект);
	КонецЕсли; 
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Параметры.
	Если ЗначениеЗаполнено(ПолучитьСвойство(Параметры, "ЗначениеКопирования")) Тогда
		ОбъектЗаполнения = Параметры.ЗначениеКопирования;
	Иначе
		ОбъектЗаполнения = ТекущийОбъект;
	КонецЕсли; 
	РегистрыСведений.НастройкиПользователей.ПолучитьНастройкиПользователей(ОбъектЗаполнения, НастройкиПользователей);
	РегистрыСведений.ЗначенияДополнительныхПравПользователя.ПолучитьПраваПользователей(ОбъектЗаполнения, ДополнительныеПраваПользователей);
	РегистрыСведений.НастройкиПравДоступаОбъектов.ПолучитьПраваДоступаОбъектов(ОбъектЗаполнения, ПраваДоступаОбъектов);
	//РегистрыСведений.НастройкиПравДоступаПользователей.ПолучитьПраваДоступаПользователей(ОбъектЗаполнения, Новый ОписаниеТипов("СправочникСсылка.ВидыМеню, СправочникСсылка.Меню"), ПраваДоступаПользователей);
	
	//Костенюк Александр-Старт 08.10.2012
	РегистрыСведений.НастройкиПравДоступаПользователей.ПолучитьПраваДоступаПользователей(ОбъектЗаполнения, Новый ОписаниеТипов("СправочникСсылка.ВидыМеню, СправочникСсылка.Меню, СправочникСсылка.ТипыСкидокНаценок"), ПраваДоступаПользователей);
	//Костенюк Александр-Финиш 08.10.2012
	
	// Настройка формы.
	Элементы.ГруппаНастройкиПользователей.Видимость = РегистрыСведений.НастройкиПользователей.ПолучитьПрисутсвиеНастроекПользователей(ОбъектЗаполнения);
	Элементы.ГруппаПраваДоступаОбъектов.Видимость = РегистрыСведений.НастройкиПравДоступаОбъектов.ПолучитьПрисутсвиеПравДоступаОбъектов(ОбъектЗаполнения);
	Элементы.ГруппаПраваДоступаПользователей.Видимость = РегистрыСведений.НастройкиПравДоступаПользователей.ПолучитьПрисутсвиеПравДоступаПользователей(ОбъектЗаполнения);
	
	РасширенныеНастройкиНаСервере(Элементы.ГруппаНастройкиПользователей.Видимость Или
								  Элементы.ГруппаПраваДоступаОбъектов.Видимость Или
								  Элементы.ГруппаПраваДоступаПользователей.Видимость);
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Параметры.
	Если Не Отказ Тогда
		РегистрыСведений.НастройкиПользователей.УстановитьНастройкиПользователей(ТекущийОбъект, НастройкиПользователей, Отказ);
		
		Элементы.ГруппаНастройкиПользователей.Видимость = Элементы.ГруппаНастройкиПользователей.Видимость Или Отказ;
	КонецЕсли; 
	Если Не Отказ Тогда
		РегистрыСведений.ЗначенияДополнительныхПравПользователя.УстановитьПраваПользователей(ТекущийОбъект, ДополнительныеПраваПользователей, Отказ);
		
		Элементы.ГруппаДополнительныеПраваПользователей.Видимость = Элементы.ГруппаДополнительныеПраваПользователей.Видимость Или Отказ;
	КонецЕсли; 
	Если Не Отказ Тогда
		РегистрыСведений.НастройкиПравДоступаОбъектов.УстановитьПраваДоступаОбъектов(ТекущийОбъект, ПраваДоступаОбъектов, Отказ);
		
		Элементы.ГруппаПраваДоступаОбъектов.Видимость = Элементы.ГруппаПраваДоступаОбъектов.Видимость Или Отказ;
	КонецЕсли; 
	Если Не Отказ Тогда
		РегистрыСведений.НастройкиПравДоступаПользователей.УстановитьПраваДоступаПользователей(ТекущийОбъект, ПраваДоступаПользователей, Отказ);
		
		Элементы.ГруппаПраваДоступаПользователей.Видимость = Элементы.ГруппаПраваДоступаПользователей.Видимость Или Отказ;
	КонецЕсли; 
	
	// Настройка формы.
	РасширенныеНастройкиНаСервере(Элементы.ГруппаНастройкиПользователей.Видимость Или
								  Элементы.ГруппаПраваДоступаОбъектов.Видимость Или
								  Элементы.ГруппаПраваДоступаПользователей.Видимость);

КонецПроцедуры // ПриЗаписиНаСервере()
